In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from scipy.stats import linregress

In [54]:
#Import tables from Data and convert them to dataframes.
reveal_data =  pd.read_csv("Data/Reveal_EEO1_for_2016.csv")
tech_sector_data = pd.read_csv("Data/Tech_sector_diversity_demographics_2016.csv")
reveal_data_df = pd.DataFrame(reveal_data)
tech_sector_data_df = pd.DataFrame(tech_sector_data)

      company  year                race gender          job_category count
0     23andMe  2016  Hispanic_or_Latino   male            Executives     0
1     23andMe  2016  Hispanic_or_Latino   male              Managers     1
2     23andMe  2016  Hispanic_or_Latino   male         Professionals     7
3     23andMe  2016  Hispanic_or_Latino   male           Technicians     0
4     23andMe  2016  Hispanic_or_Latino   male         Sales workers     0
...       ...   ...                 ...    ...                   ...   ...
4495  Sanmina  2016      Overall_totals    NaN  laborers and helpers     4
4496  Sanmina  2016      Overall_totals    NaN       Service workers    57
4497  Sanmina  2016      Overall_totals    NaN                Totals  5205
4498  Sanmina  2016      Overall_totals    NaN       Previous_totals  5615
4499  Sanmina  2016      Overall_totals    NaN              Managers   591

[4500 rows x 6 columns]

In [73]:
female_data = reveal_data_df[reveal_data_df["gender"]=="female"]
female_data_professionals = female_data[female_data["job_category"]=="Professionals"]

# #Convert count column's values to numerric.
female_data_professionals ["count"] = pd.to_numeric(female_data_professionals["count"])
female_data_professionals.dtypes

<ipython-input-73-264255d4e4d9>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  female_data_professionals ["count"] = pd.to_numeric(female_data_professionals["count"])

company         object
year             int64
race            object
gender          object
job_category    object
count            int64
dtype: object

In [74]:
race_data =female_data_professionals.groupby("race")["count"]
race_data.sum().to_frame()

                                     count
race
American_Indian_Alaskan_Native         171
Asian                                23610
Black_or_African_American             2562
Hispanic_or_Latino                    3379
Native_Hawaiian_or_Pacific_Islander    311
Two_or_more_races                      983
White                                29432